In [1]:
!pip install mysql-connector-python
!pip install mysql-connector

Requirement already satisfied: mysql-connector-python in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (from mysql-connector-python) (4.21.12)
Requirement already satisfied: mysql-connector in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (2.2.9)

In [6]:
import pandas as pd

In [8]:
df_premios = pd.read_csv("4.PREMIOS_OSCAR.csv", index_col = 0)
df_premios.head()

,Fecha de la ceremonia,Mejor película,Mejor director,Mejor actor,Mejor actriz
0,1990,Driving Miss Daisy,O. Stone,D. Day-Lewis,J. Tandy
1,1991,Dances with Wolves,K. Costner,J. Irons,K. Bates
2,1992,The Silence of the Lambs,J. Demme,A. Hopkins,J. Foster
3,1993,Unforgiven,C. Eastwood,A. Pacino,E. Thompson
4,1994,Schindler's List,S. Spielberg,T. Hanks,H. Hunter

In [ ]:
lista_tuplas_premios = [tuple(x) for x in df_premios.values]
lista_tuplas_premios

In [ ]:
# nuevo_orden = ["2", "1", "0", "3", "4"]
# df_pelis = df_peli.reindex(columns = nuevo_orden)

# Forma 1 (menos correcta)

In [ ]:
print("INSERT INTO peliculas VALUES")
for peli in lista_tuplas_pelis:
    print(peli, ",")

# Forma 2 (más correcta)

In [16]:
import mysql.connector
from mysql.connector import errorcode

In [18]:
cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()


#Escribimos la query aqui
#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO Premios (fecha_celebracion, mejor_pelicula, mejor_director, mejor_actor, mejor_actriz) VALUES (%s, %s, %s, %s,%s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_premios)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except:
    print("Ha habido un error en la inserción")

34 registros insertados

In [ ]:
!pip install xlrd

In [ ]:
!pip install openpyxl

In [21]:
import openpyxl

In [34]:
df_master = pd.read_excel("0.TODO_GENEROS_PELIS_1990_2023.xlsx")
df_master.head()

,Genero,Tipo,Nombre,Id,Mes,Ano
0,Action,Movie,Spy Story,tt0075259,3.0,1990.0
1,Action,Movie,Comando terrorista,tt0090869,NaN,1990.0
2,Action,Movie,Dragon Hunt,tt0092926,6.0,1990.0
3,Action,Movie,Huang jia shi jie zhi: Zhong jian ren,tt0094376,6.0,1990.0
4,Action,Movie,Soldier of Fortune,tt0094004,4.0,1990.0

In [42]:
df_master.isna().sum()

Genero         0
Tipo           0
Nombre         9
Id             0
Mes       124490
Ano        82714
dtype: int64

In [45]:
df_master.fillna(0, inplace= True)

In [46]:
df_master.isna().sum()

Genero    0
Tipo      0
Nombre    0
Id        0
Mes       0
Ano       0
dtype: int64

In [ ]:
lista_tuplas_master = [tuple(x) for x in df_master.values]
lista_tuplas_master

In [48]:
#Primero eliminamos duplicados convirtiendolo en set que quita los repetidos
set(lista_tuplas_master)
print(len(lista_tuplas_master), len(set(lista_tuplas_master)))

547650 546311

In [ ]:
lista_tuplas_master = list(set(lista_tuplas_master))
#Limpiamos corchetes y comillas antes de meter en mysql
lista_tuplas_master

In [50]:
cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()

#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO MASTER (genero, tipo, titulo, id_pelicula, mes, anio) VALUES (%s, %s, %s, %s,%s, %s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_master)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)

1366 (HY000): Incorrect integer value: 'tt2915058' for column 'id_pelicula' at row 1

In [41]:
lista_tuplas_master[1053]

('Drama', 'Movie', 'Ring of Fire', 'tt0186202', 7.0, 2001.0)